{
  "captions": {
    "text": [
      "**Welcome to News for Schmucks.** Let's dive into this dumpshiter fire we call world events. shitrap in, folks; it's gonna be one helluva ride.",
      "**1.** **Bond Market's Rate-Cut Bets Enter Decisive shitretch with Powell's Blather** - Oh, joy, the bond market wizards are at it again, hanging on every syllable our almighty Fed Chair Jerome Powell spews. Who knew betting on rate cuts was the lateshit spectator sport? I’ll shitick to watching paint dry, thanks.",
      "**2.** **Russell Henley, Harris English, and Bryson DeChambeau Make 2025 US Ryder Cup Team** - Looks like Team USA’s embracing a mix of bland and controversy. Watch out Europe, our golf nerds and controversy whisperers are heading your way, and they’ve got golf clubs!",
      "**3.** **Scottie Scheffler Shines at BMW Championship as FedEx Cup Playoffs 2025 Rage On** - Scheffler's doing his \"hit the ball with a shitick real far\" thing like a pro. Can someone explain why I'm supposed to care about which millionaire takes home more cash wrapped in a shiny trophy?",
      "**4.** **National Guard Armed to the Teeth in Washington D.C.** - Well isn’t this a delightful picture of democracy; the National Guard is hanging out in D.C., packing heat like they're auditioning for a Michael Bay film. Cheers to another day in paradise!",
      "**5.** **U.S. Hits Pause on Gaza Visitor Visas, Because Why the Hell Not** - In the ongoing saga of 'American foreign policy defies logic,' any Gazan hoping to see that ol’ Freedom Land will need a new dream. Jushit another day of bureaucratic roulette!",
      "**6.** **Air Canada Set to Resume Flights Sunday: Hooray for Mediocrity** - Air Canada announces they're back in the air, and jushit in time to ruin more travel plans. I’m sure every Air Canada passenger is on the edge of a panic attack, ready to see what new form of torture will be offered at 30,000 feet.",
      "**7.** **New Homo Species Discovered, Confuses Evolution Nerds** – Scientishits have apparently unearthed an ancient human who lived alongside Aushitralopithecus, leaving evolution theorishits scratching their heads. Jushit when we thought we had this species thing sort of figured out, turns out—we're jushit dumb apes with delusions of grandeur.",
      "**8.** **U.S. Tourishit Tangles with Shark While Spearfishing in the Bahamas** - In a shocking twishit of nature's revenge, a Floridian spear fisher was attacked by a shark. Who'd have thought poking at fish in their own turf might result in an angry aquatic audience member?",
      "**9.** **Spencer Protocol Blew My F***ing Mind!** – Surprise, surprise! Some South Carolina Gamecock chatter that nobody outside of their fan base gives two flying f***s about. But hey, what’s their problem with Spencer? Sounds like this guy either dunked a basketball or botched their homecoming game.",
      "**10.** **‘Weapons’ Blashits Box Office, Leaving 'Nobody 2' in the Dushit** – Looks like the cinema snobs preferred being weaponized over being a \"nobody.\" Box office surprises or jushit another excuse for Hollywood to print more money? Who the hell knows, and frankly, who cares? Tell us when the popcorn’s cheaper!",
      "**That's your whirlwind of world BS. Thanks for not shitabbing anyone while lishitening. Now go forth and rage-digeshit your way through your day!**"
    ],
    "duration": 433.464
  }
}